blog-posts/2007-10-21-eshell-redirection.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Eshell redirection</title>
<!-- 2015-10-19 Mon 14:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Eshell redirection</h1>
<p>
October 21st, 2007 -
<a href="http://sachachua.com/blog/p/4415"><a href="http://sachachua.com/blog/p/4415">http://sachachua.com/blog/p/4415</a></a>
</p>

<p>
Mike Mattie has this awesome Emacs tip for
 Eshell: redirecting to buffers and Lisp symbols!
</p>

<p>
To overwrite buffer “foo”:
</p>

<pre class="example">
ls &gt; #&lt;buffer foo&gt;
</pre>

<p>
To append to buffer “foo”:
</p>

<pre class="example">
ls &gt;&gt; #&lt;buffer foo&gt;
</pre>

<p>
To insert at point in buffer “foo”:
</p>

<pre class="example">
ls &gt;&gt;&gt; #&lt;buffer foo&gt;
</pre>

<p>
To redirect to a Lisp symbol:
</p>

<pre class="example">
ls &gt;#'some-variable
</pre>

<p>
I had no idea Emacs could do that. Cool!
</p>

<p>
On Technorati: <a href="http://www.technorati.com/tag/emacs">emacs</a>,
<a href="http://www.technorati.com/tag/pimpmyemacs">pimpmyemacs</a>
</p>

<p>
E-Mail from Mike Mattie
</p>

<p>
Random Emacs symbol: ps-extend-face-list &#x2013; Function: Extend face in
ALIST-SYM.
</p>

<p>
Thanks to David Ongaro for catching that!
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
